Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUnique Property
 Sheet views cannot contain more than one instance of "%1!s!."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewOnASheetMustBeUnique { get; }
Public Shared ReadOnly Property ViewOnASheetMustBeUnique As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewOnASheetMustBeUnique {
	FailureDefinitionId^ get ();
}
static member ViewOnASheetMustBeUnique : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace